In [1]:
import pandas as pd

C:\Users\kmuga\AppData\Local\Temp\ipykernel_11892\4080736814.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
df1 = pd.DataFrame({'city':['Sangli','Kolhapur','Pune'],
                    'temperture':['21','14','35']})

In [4]:
df2 = pd.DataFrame({'city':['Sangli','Kolhapur','Pune'],
                    'humidity':['80','90','65']})

In [5]:
df3 = pd.merge(df1,df2,on="city")

In [6]:
df3.head()

       city temperture humidity
0    Sangli         21       80
1  Kolhapur         14       90
2      Pune         35       65

In [10]:
df1 = pd.DataFrame({'city':['Sangli','Kolhapur','Pune','Nashik'],
                    'temperture':['21','14','35','31']})

df2 = pd.DataFrame({'city':['Sangli','Kolhapur','Pune'],
                    'humidity':['80','90','65']})

In [12]:
df3 = pd.merge(df1,df2,on="city",how="left")

In [13]:
df3.head()

       city temperture humidity
0    Sangli         21       80
1  Kolhapur         14       90
2      Pune         35       65
3    Nashik         31      NaN

In [15]:
df1 = pd.DataFrame({'city':['Sangli','Kolhapur','Pune','Nashik'],
                    'temperture':['21','14','35','31']})

df2 = pd.DataFrame({'city':['Sangli','Kolhapur','Pune'],
                    'humidity':['80','90','65']})

In [14]:
df4 = pd.merge(df2,df1,on="city",how="right")

In [16]:
df4.head()

       city humidity temperture
0    Sangli       80         21
1  Kolhapur       90         14
2      Pune       65         35
3    Nashik      NaN         31

In [17]:
df1 = pd.DataFrame({'city':['Sangli','Kolhapur','Pune','Nashik'],
                    'temperture':['21','14','35','31']})

df2 = pd.DataFrame({'city':['Sangli','Kolhapur','Pune','Satara'],
                    'humidity':['80','90','65','67']})

In [18]:
df4 = pd.merge(df1,df2,on="city",how="outer")

In [19]:
df4.head()

       city temperture humidity
0  Kolhapur         14       90
1    Nashik         31      NaN
2      Pune         35       65
3    Sangli         21       80
4    Satara        NaN       67

In [20]:
df4 = pd.merge(df1,df2,on="city",how="outer",indicator=True)

In [21]:
df4.head()

       city temperture humidity      _merge
0  Kolhapur         14       90        both
1    Nashik         31      NaN   left_only
2      Pune         35       65        both
3    Sangli         21       80        both
4    Satara        NaN       67  right_only

In [23]:
df1 = pd.DataFrame({'city':['Sangli','Kolhapur','Pune','Nashik'],
                    'temperture':['21','14','35','31']})

df2 = pd.DataFrame({'city':['Sangli','Kolhapur'],
                    'temperture':['21','14'],
                    'humidity':['80','90']})

In [24]:
df5 = pd.merge(df1,df2,on="city",how="outer",suffixes=('_first','_second'))

In [25]:
df5.head()

       city temperture_first temperture_second humidity
0  Kolhapur               14                14       90
1    Nashik               31               NaN      NaN
2      Pune               35               NaN      NaN
3    Sangli               21                21       80